function result = Newton_Cotes(a, b, n)
  % 为 fx = 1 /(1 + x ^ 2)函数的Newton-Cotes求积
  % a, b为积分边界， n为区间分成的份数

  % n = 1 : 7 的cotes系数表
  Ctable = [1/2 1/2 0 0 0 0 0 0 0;
            1/6 2/3 1/6 0 0 0 0 0 0;
            1/8 3/8 3/8 1/8 0 0 0 0 0;
            7/90 16/45 2/15 16/45 7/90 0 0 0 0;
            19/288 25/96 25/144 25/144 25/96 19/288 0 0 0;
            41/840 9/35 9/280 34/105 9/280 9/35 41/840 0 0;
            3577/17280 3577/17280 1323/17280 2989/17280 2989/17280 1323/17280 3577/17280 3577/17280 0];

  % 各节点及其函数值
  x = linspace(a, b, n + 1);
  fx = 1 ./ (1 + x .^ 2);

  % 增加维数便于向量化计算
  fx = [fx ones(1, length(Ctable) - (n + 1))];

  % 结果
  result = fx * Ctable(n,:)' * (b - a);
 end

